app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "han solo"], ["body", "i have a bad feeling about this"], ["post_id", 4], ["created_at", "2016-01-30 19:38:23.264498"], ["updated_at", "2016-01-30 19:38:23.264498"]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.post_id = params[:post_id]

		@comment.save