imposter.me/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post"], ["body", "This is the body of the post"], ["created_at", "2016-01-30 15:37:30.908665"], ["updated_at", "2016-01-30 15:37:30.908665"]]
---
	def create
		@post = Post.new(post_params)
		@post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "More blah"], ["updated_at", "2016-01-30 16:10:02.717019"], ["id", 4]]
---
	def update
		@post = Post.find(params[:id])
		@post.update(post_params)